Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.2.68/atdf/ATSAML10E14A.atdf
        <module name="EVSYS" id="U2504" version="2.0.0">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="ASYNCHRONOUS_CHANNELS" value="0x000000F0" caption="Mask of Only Asynchronous Channels"/>
              <param name="CHANNELS" value="8" caption="Number of Channels"/>
              <param name="CHANNELS_BITS" value="3" caption="Number of bits to select Channel"/>
              <param name="GCLK_ID_0" value="6" caption="Index of Generic Clock 0"/>
              <param name="GCLK_ID_1" value="7" caption="Index of Generic Clock 1"/>
              <param name="GCLK_ID_2" value="8" caption="Index of Generic Clock 2"/>
              <param name="GCLK_ID_3" value="9" caption="Index of Generic Clock 3"/>
              <param name="GENERATORS" value="49" caption="Total Number of Event Generators"/>
              <param name="GENERATORS_BITS" value="6" caption="Number of bits to select Event Generator"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Secure Channels/Users supported?"/>
              <param name="SYNCH_NUM" value="4" caption="Number of Synchronous Channels"/>
              <param name="SYNCH_NUM_BITS" value="2" caption="Number of bits to select Synchronous Channels"/>
              <param name="USERS" value="23" caption="Total Number of Event Users"/>
              <param name="USERS_BITS" value="5" caption="Number of bits to select Event User"/>
              <param name="USERS_GROUPS" value="1" caption="Number of 32-user groups"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="U2257" version="2.1.0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="4" caption="Index of measure generic clock"/>
              <param name="GCLK_ID_REF" value="5" caption="Index of reference generic clock"/>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2122" version="1.1.2">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001C00"/>
            <signals>
              <signal group="IO" index="0" function="H" pad="PA30"/>
              <signal group="IO" index="0" function="H" pad="PA14"/>
              <signal group="IO" index="0" function="H" pad="PA27"/>
              <signal group="IO" index="1" function="H" pad="PA23"/>
              <signal group="IO" index="1" function="H" pad="PA15"/>
              <signal group="IO" index="2" function="H" pad="PA16"/>
              <signal group="IO" index="2" function="H" pad="PA22"/>
              <signal group="IO" index="3" function="H" pad="PA11"/>
              <signal group="IO" index="3" function="H" pad="PA17"/>
              <signal group="IO" index="4" function="H" pad="PA10"/>
            </signals>
            <parameters>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="3"/>
              <param name="GEN_NUM" value="5" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="4" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="7" caption="Number of Generic Clock Sources - 1"/>
              <param name="NUM" value="21" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="3"/>
              <param name="SOURCE_NUM" value="8" caption="Number of Generic Clock Sources"/>
              <param name="INSTANCE_ID" value="7"/>
            </parameters>
          </instance>
        </module>
        <module name="IDAU" id="U2803" version="1.0.0">
          <instance name="IDAU">
            <register-group name="IDAU" name-in-module="IDAU" address-space="base" offset="0x41000000"/>
            <parameters>
              <param name="GRANULARITY_BOOTPROT" value="0x100" caption="BOOTPROT region granularity"/>
              <param name="REGION_BOOTROM" value="0x09" caption="Boot ROM region number"/>
              <param name="REGION_IOBUS" value="0x00" caption="IOBUS region number (invalid)"/>
              <param name="REGION_OTHER" value="0x00" caption="Others region number (invalid)"/>
              <param name="REGION_PERIPHERALS" value="0x00" caption="Peripherals region number (invalid)"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="MCLK" id="U2234" version="3.0.0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x40000800"/>
            <parameters>
              <param name="MCLK_CLK_APB_NUM" value="3"/>
              <param name="SYSTEM_CLOCK" value="4000000" caption="System Clock Frequency at Reset"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="APBA" bit="0"/>
                <clock name="APBB" bit="1"/>
                <clock name="APBC" bit="2"/>
                <clock name="DMAC" bit="3"/>
                <clock name="DSU" bit="4"/>
                <clock name="PAC" bit="6"/>
                <clock name="NVMCTRL" bit="7"/>
                <clock name="TRAM" bit="12"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="NVMCTRL" id="U2802" version="1.0.0">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <signals>
              <signal group="MARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="DATAFLASH_PAGES" value="32"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="ROW_PAGES" value="4"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Security Configuration implemented?"/>
              <param name="FLASH_SIZE" value="16384"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="256"/>
              <param name="PAGES_PR_REGION" value="16"/>
              <!--  From Datasheet section "Electrical Characteristics","Flash Characteristics" table "Maximum operating Frequency" -->
              <param name="PSM_0_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="PSM_0_FRMLP_FWS_0_MAX_FREQ" value="18000000"/>
              <param name="PSM_0_FRMLP_FWS_1_MAX_FREQ" value="36000000"/>
              <param name="PSM_0_FRMHS_FWS_0_MAX_FREQ" value="25000000"/>
              <param name="PSM_0_FRMHS_FWS_1_MAX_FREQ" value="50000000"/>
              <param name="PSM_1_FRMFW_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="PSM_1_FRMLP_FWS_0_MAX_FREQ" value="8000000"/>
              <param name="PSM_1_FRMLP_FWS_1_MAX_FREQ" value="12000000"/>
              <param name="INSTANCE_ID" value="34"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="U2802" version="1.0.0">
          <instance name="FUSES">
            <register-group name="BOCOR_FUSES" name-in-module="BOCOR_FUSES" address-space="fuses" offset="0x0080C000"/>
            <register-group name="SW_CALIB_FUSES" name-in-module="SW_CALIB_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="TEMP_LOG_FUSES" name-in-module="TEMP_LOG_FUSES" address-space="fuses" offset="0x00806038"/>
