Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.2.68/atdf/ATSAML10E14A.atdf
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="OPAMP" id="U2237" version="2.0.0">
          <instance name="OPAMP">
            <register-group name="OPAMP" name-in-module="OPAMP" address-space="base" offset="0x42003000"/>
            <signals>
              <signal group="OANEG" index="0" function="B" pad="PA02"/>
              <signal group="OANEG" index="1" function="B" pad="PA00"/>
              <signal group="OANEG" index="2" function="B" pad="PA03"/>
              <signal group="OAOUT" index="0" function="B" pad="PA07"/>
              <signal group="OAOUT" index="2" function="B" pad="PA04"/>
              <signal group="OAPOS" index="0" function="B" pad="PA06"/>
              <signal group="OAPOS" index="1" function="B" pad="PA01"/>
              <signal group="OAPOS" index="2" function="B" pad="PA05"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="76"/>
              <param name="NUM_OPAMPS" value="3" caption="Number of op amps"/>
            </parameters>
          </instance>
        </module>
        <module name="OSCCTRL" id="U2119" version="4.0.0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PA14"/>
              <signal group="XOUT" function="XOUT" pad="PA15"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_DFLLULP" value="2" caption="Index of Generic Clock for DFLLULP"/>
              <param name="GCLK_ID_DPLL" value="0" caption="Index of Generic Clock for DPLL"/>
              <param name="GCLK_ID_DPLL32K" value="1" caption="Index of Generic Clock for DPLL 32K"/>
              <param name="CFD_VERSION" value="0x112"/>
              <param name="DFLLULP_VERSION" value="0x100"/>
              <param name="FDPLL_VERSION" value="0x213"/>
              <param name="OSC16M_VERSION" value="0x102"/>
              <param name="XOSC_VERSION" value="0x210"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="U2246" version="4.0.0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x40001400"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="OSC32K_COARSE_CALIB_MSB" value="0"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" version="2.0.0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="APB_NUM" value="3" caption="Number of bridges AHB/APB"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Security Configuration implemented?"/>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2240" version="3.1.0">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="BIAS_RAM_HS" value="1" caption="one if RAM HS can be back biased"/>
              <param name="HAS_IDLE2_SLEEP_AS_IDLE" value="1" caption="IDLE2 Sleep mode is called IDLE"/>
              <param name="HAS_BBIASTR_BIT" value="1" caption="one if RAM HS can be back biased"/>
              <param name="HAS_DPGPDSW_BIT" value="1" caption="one if RAM HS can be back biased"/>
              <param name="PD_NUM" value="1" caption="Number of switchable Power Domain"/>
              <param name="HAS_PLCFG" value="1" caption="Performance Level Configuration supported"/>
              <param name="HAS_PDCFG_BIT" value="1" caption="PDCFG bit is present"/>
              <param name="HAS_PWCFG" value="1" caption="PWCFG register is present"/>
              <param name="HAS_OFF_SLEEP" value="1" caption="OFF Sleep mode supported"/>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="PORT" id="U2210" version="3.0.0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x40003000"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
            </signals>
            <parameters>
              <param name="BITS" value="32"/>
              <param name="DRVSTR" value="1" caption="DRVSTR supported"/>
              <param name="EV_NUM" value="4"/>
              <param name="GROUPS" value="1"/>
              <param name="MSB" value="31"/>
              <param name="ODRAIN" value="0" caption="ODRAIN supported"/>
              <param name="PPP_IMPLEMENTED" value="0" caption="IOBUS2 implemented?"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Secure I/Os supported?"/>
              <param name="SLEWLIM" value="0" caption="SLEWLIM supported"/>
              <param name="INSTANCE_ID" value="12"/>
            </parameters>
          </instance>
        </module>
        <module name="PTC" id="U2215" version="5.0.0">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="DRV" index="0" function="F" pad="PA00"/>
              <signal group="DRV" index="1" function="F" pad="PA01"/>
              <signal group="DRV" index="2" function="F" pad="PA02"/>
              <signal group="DRV" index="3" function="F" pad="PA03"/>
              <signal group="DRV" index="4" function="F" pad="PA05"/>
              <signal group="DRV" index="5" function="F" pad="PA06"/>
              <signal group="DRV" index="6" function="F" pad="PA08"/>
              <signal group="DRV" index="7" function="F" pad="PA09"/>
              <signal group="DRV" index="8" function="F" pad="PA10"/>
              <signal group="DRV" index="9" function="F" pad="PA11"/>
              <signal group="DRV" index="10" function="F" pad="PA14"/>
              <signal group="DRV" index="11" function="F" pad="PA15"/>
              <signal group="DRV" index="12" function="F" pad="PA16"/>
              <signal group="DRV" index="13" function="F" pad="PA17"/>
              <signal group="DRV" index="14" function="F" pad="PA18"/>
              <signal group="DRV" index="15" function="F" pad="PA19"/>
              <signal group="DRV" index="16" function="F" pad="PA22"/>
              <signal group="DRV" index="17" function="F" pad="PA23"/>
              <signal group="DRV" index="18" function="F" pad="PA30"/>
              <signal group="DRV" index="19" function="F" pad="PA31"/>
              <signal group="ECI" index="0" function="B" pad="PA03"/>
              <signal group="ECI" index="1" function="B" pad="PA04"/>
              <signal group="ECI" index="2" function="B" pad="PA05"/>
              <signal group="ECI" index="3" function="B" pad="PA06"/>
              <signal group="X" index="0" function="B" pad="PA00"/>
              <signal group="Y" index="0" function="B" pad="PA00"/>
              <signal group="X" index="1" function="B" pad="PA01"/>
              <signal group="Y" index="1" function="B" pad="PA01"/>
              <signal group="X" index="2" function="B" pad="PA02"/>
              <signal group="Y" index="2" function="B" pad="PA02"/>
              <signal group="X" index="3" function="B" pad="PA03"/>
              <signal group="Y" index="3" function="B" pad="PA03"/>
              <signal group="X" index="4" function="B" pad="PA05"/>
              <signal group="Y" index="4" function="B" pad="PA05"/>
              <signal group="X" index="5" function="B" pad="PA06"/>
              <signal group="Y" index="5" function="B" pad="PA06"/>
              <signal group="X" index="6" function="B" pad="PA08"/>
              <signal group="Y" index="6" function="B" pad="PA08"/>
              <signal group="X" index="7" function="B" pad="PA09"/>
              <signal group="Y" index="7" function="B" pad="PA09"/>
              <signal group="X" index="8" function="B" pad="PA10"/>
              <signal group="Y" index="8" function="B" pad="PA10"/>
              <signal group="X" index="9" function="B" pad="PA11"/>
              <signal group="Y" index="9" function="B" pad="PA11"/>
              <signal group="X" index="10" function="B" pad="PA14"/>
              <signal group="Y" index="10" function="B" pad="PA14"/>
              <signal group="X" index="11" function="B" pad="PA15"/>
              <signal group="Y" index="11" function="B" pad="PA15"/>
              <signal group="X" index="12" function="B" pad="PA16"/>
              <signal group="Y" index="12" function="B" pad="PA16"/>
              <signal group="X" index="13" function="B" pad="PA17"/>
              <signal group="Y" index="13" function="B" pad="PA17"/>
              <signal group="X" index="14" function="B" pad="PA18"/>
              <signal group="Y" index="14" function="B" pad="PA18"/>
              <signal group="X" index="15" function="B" pad="PA19"/>
              <signal group="Y" index="15" function="B" pad="PA19"/>
              <signal group="X" index="16" function="B" pad="PA22"/>
              <signal group="Y" index="16" function="B" pad="PA22"/>
              <signal group="X" index="17" function="B" pad="PA23"/>
              <signal group="Y" index="17" function="B" pad="PA23"/>
              <signal group="X" index="18" function="B" pad="PA30"/>
              <signal group="Y" index="18" function="B" pad="PA30"/>
              <signal group="X" index="19" function="B" pad="PA31"/>
              <signal group="Y" index="19" function="B" pad="PA31"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EOC" value="21" caption="Index of DMA EOC trigger"/>
              <param name="DMAC_ID_SEQ" value="22" caption="Index of DMA SEQ trigger"/>
              <param name="DMAC_ID_WCOMP" value="23" caption="Index of DMA WCOMP trigger"/>
              <param name="GCLK_ID" value="19" caption="Index of Generic Clock"/>
              <param name="LINES_MSB" value="19"/>
              <param name="LINES_NUM" value="20" caption="Number of PTC lines"/>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="U2239" version="3.0.0">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x40000C00"/>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="0"/>
              <param name="NUMBER_OF_EXTWAKE" value="0" caption="number of external wakeup line"/>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" version="3.0.0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40002400"/>
            <signals>
              <signal group="IN" index="0" function="G" pad="PA08"/>
              <signal group="IN" index="1" function="G" pad="PA09"/>
              <signal group="IN" index="2" function="G" pad="PA16"/>
              <signal group="IN" index="3" function="G" pad="PA17"/>
              <signal group="OUT" index="0" function="G" pad="PA18"/>
              <signal group="OUT" index="1" function="G" pad="PA19"/>
              <signal group="OUT" index="2" function="G" pad="PA22"/>
              <signal group="OUT" index="3" function="G" pad="PA23"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TIMESTAMP" value="1" caption="DMA RTC timestamp trigger"/>
              <param name="GPR_NUM" value="2" caption="Number of General-Purpose Registers"/>
              <param name="NUM_OF_ALARMS" value="1" caption="Number of Alarms"/>
              <param name="NUM_OF_BKREGS" value="0" caption="Number of Backup Registers"/>
              <param name="NUM_OF_COMP16" value="2" caption="Number of 16-bit Comparators"/>
              <param name="NUM_OF_COMP32" value="1" caption="Number of 32-bit Comparators"/>
              <param name="NUM_OF_TAMPERS" value="4" caption="Number of Tamper Inputs"/>
              <param name="PER_NUM" value="8" caption="Number of Periodic Intervals"/>
              <param name="INSTANCE_ID" value="9"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="4.1.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="D" pad="PA16"/>
              <signal group="PAD" index="0" function="C" pad="PA22"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="D" pad="PA17"/>
              <signal group="PAD" index="1" function="C" pad="PA23"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="D" pad="PA14"/>
              <signal group="PAD" index="2" function="D" pad="PA18"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="2" function="D" pad="PA02"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="D" pad="PA15"/>
              <signal group="PAD" index="3" function="D" pad="PA19"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
              <signal group="PAD" index="3" function="D" pad="PA03"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="4" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="5" caption="Index of DMA TX trigger"/>
              <param name="FIFO_DEPTH_POWER" value="1" caption="Rx Fifo depth = 2^FIFO_DEPTH_POWER"/>
              <param name="GCLK_ID_CORE" value="11"/>
              <param name="GCLK_ID_SLOW" value="10"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="SPI_TX_READY_INT_SRC" value="22" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="23" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="24" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="25" caption="SPI ERROR Interrupt"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="I2C_0_INT_SRC" value="22" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="23" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="24" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="25" caption="I2C 3 Interrupt"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="0" caption="USART AUTOBAUD mode implemented?"/>
              <param name="USART_ISO7816" value="0" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="0" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="0" caption="USART RS485 mode implemented?"/>
              <param name="USART_TX_READY_INT_SRC" value="22" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="23" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="24" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="25" caption="USART ERROR Interrupt"/>
              <param name="INSTANCE_ID" value="65"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PA16"/>
              <signal group="PAD" index="0" function="C" pad="PA08"/>
              <signal group="PAD" index="0" function="D" pad="PA00"/>
              <signal group="PAD" index="1" function="C" pad="PA17"/>
              <signal group="PAD" index="1" function="C" pad="PA09"/>
              <signal group="PAD" index="1" function="D" pad="PA01"/>
              <signal group="PAD" index="2" function="C" pad="PA18"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="3" function="C" pad="PA19"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="6" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="7" caption="Index of DMA TX trigger"/>
              <param name="FIFO_DEPTH_POWER" value="2" caption="Rx Fifo depth = 2^FIFO_DEPTH_POWER"/>
              <param name="GCLK_ID_CORE" value="12"/>
              <param name="GCLK_ID_SLOW" value="10"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="SPI_TX_READY_INT_SRC" value="26" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="27" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="28" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="29" caption="SPI ERROR Interrupt"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?"/>
              <param name="I2C_0_INT_SRC" value="26" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="27" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="28" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="29" caption="I2C 3 Interrupt"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="0" caption="USART AUTOBAUD mode implemented?"/>
              <param name="USART_ISO7816" value="0" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="0" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="0" caption="USART RS485 mode implemented?"/>
              <param name="USART_TX_READY_INT_SRC" value="26" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="27" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="28" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="29" caption="USART ERROR Interrupt"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
