Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.2.68/atdf/ATSAML10E14A.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA08"/>
              <signal group="PAD" index="0" function="D" pad="PA22"/>
              <signal group="PAD" index="1" function="D" pad="PA09"/>
              <signal group="PAD" index="1" function="D" pad="PA23"/>
              <signal group="PAD" index="2" function="D" pad="PA10"/>
              <signal group="PAD" index="2" function="D" pad="PA24"/>
              <signal group="PAD" index="2" function="C" pad="PA14"/>
              <signal group="PAD" index="3" function="D" pad="PA11"/>
              <signal group="PAD" index="3" function="D" pad="PA25"/>
              <signal group="PAD" index="3" function="C" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="8" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="9" caption="Index of DMA TX trigger"/>
              <param name="FIFO_DEPTH_POWER" value="1" caption="Rx Fifo depth = 2^FIFO_DEPTH_POWER"/>
              <param name="GCLK_ID_CORE" value="13"/>
              <param name="GCLK_ID_SLOW" value="10"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="SPI_TX_READY_INT_SRC" value="30" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="31" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="32" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="33" caption="SPI ERROR Interrupt"/>
              <param name="TWIM" value="0" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="0" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?"/>
              <param name="I2C_0_INT_SRC" value="30" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="31" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="32" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="33" caption="I2C 3 Interrupt"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART AUTOBAUD mode implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="0" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="USART_TX_READY_INT_SRC" value="30" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="31" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="32" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="33" caption="USART ERROR Interrupt"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="U2117" version="4.0.0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001800"/>
            <parameters>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="INSTANCE_ID" value="6"/>
              <param name="HAS_STDBYPL0_BIT" value="1" caption="STDBYPL0 bit is present"/>
              <param name="HAS_LPEFF_BIT" value="1" caption="LPEFF bit is present"/>
              <param name="HAS_SEL_BIT" value="1" caption="SEL bit is present"/>
              <param name="HAS_BOD33_REG_NAME" value="1" caption="Name of BOD register is BOD33"/>
              <param name="HAS_VREFSEL_BIT" value="1" caption="VREFSEL bit is present"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="3.1.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="10" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="1" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="14" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="68"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="13" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="1" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="14" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA00"/>
              <signal group="WO" index="0" function="E" pad="PA18"/>
              <signal group="WO" index="1" function="E" pad="PA01"/>
              <signal group="WO" index="1" function="E" pad="PA19"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="16" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="1" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="15" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
        </module>
        <module name="TRAM" id="U2801" version="1.0.0">
          <instance name="TRAM">
            <register-group name="TRAM" name-in-module="TRAM" address-space="base" offset="0x42003400"/>
            <parameters>
              <param name="INSTANCE_ID" value="77"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="U2242" version="1.2.0">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x42002800"/>
            <parameters>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="2.0.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
        <module name="CoreDebug" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000EDF0"/>
