Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.2.68/atdf/ATSAML10E14A.atdf
        <register name="MPU_MAIR0" offset="0x30" rw="RW" size="4" access-size="4" caption="MPU Memory Attribute Indirection Register 0">
          <bitfield name="Attr0" caption="Attribute of MPU region 0" mask="0xFF"/>
          <bitfield name="Attr1" caption="Attribute of MPU region 1" mask="0xFF00"/>
          <bitfield name="Attr2" caption="Attribute of MPU region 2" mask="0xFF0000"/>
          <bitfield name="Attr3" caption="Attribute of MPU region 3" mask="0xFF000000"/>
        </register>
        <register name="MPU_MAIR1" offset="0x34" rw="RW" size="4" access-size="4" caption="MPU Memory Attribute Indirection Register 1">
        </register>
      </register-group>
      <value-group name="MPU_RBAR__AP">
        <value name="RWPRIV" caption="Read/write by privileged code only" value="0"/>
        <value name="RWANY" caption="Read/write by any privilege level" value="1"/>
        <value name="RPRIV" caption="Read-only by privileged code only" value="2"/>
        <value name="RANY" caption="Read-only by any privilege level" value="3"/>
      </value-group>
      <value-group name="MPU_RBAR__SH">
        <value name="NO" caption="Non-shareable" value="0"/>
        <value name="OUTER" caption="Outer shareable" value="2"/>
        <value name="INNER" caption="Inner shareable" value="3"/>
      </value-group>
    </module>
    <module name="NVIC" version="1.0.0" caption="Nested Vectored Interrupt Controller">
      <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
        <register name="NVIC_ISER" offset="0x0" rw="RW" size="4" access-size="4" count="2" caption="Interrupt Set Enable Register n">
          <bitfield name="SETENA" caption="Set enable" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_ICER" offset="0x80" rw="RW" size="4" access-size="4" count="2" caption="Interrupt Clear Enable Register n">
          <bitfield name="CLRENA" caption="Clear enable" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_ISPR" offset="0x100" rw="RW" size="4" access-size="4" count="2" caption="Interrupt Set Pending Register n">
          <bitfield name="SETPEND" caption="Set pending" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_ICPR" offset="0x180" rw="RW" size="4" access-size="4" count="2" caption="Interrupt Clear Pending Register n">
          <bitfield name="CLRPEND" caption="Clear pending" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_IABR" offset="0x200" rw="R" size="4" access-size="4" count="2" caption="Interrupt Active Bit Register n">
          <bitfield name="ACTIVE" caption="Active state" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_ITNS" offset="0x280" rw="RW" size="4" access-size="4" count="2" caption="Interrupt Target Non-secure Register n">
          <bitfield name="ITNS" caption="Interrupt Targets Non-secure" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_IPR" offset="0x300" rw="RW" size="4" access-size="4" count="12" caption="Interrupt Priority Register n">
          <bitfield name="PRI_N0" caption="Priority of interrupt number 4n+0" mask="0xFF"/>
          <bitfield name="PRI_N1" caption="Priority of interrupt number 4n+1" mask="0xFF00"/>
          <bitfield name="PRI_N2" caption="Priority of interrupt number 4n+2" mask="0xFF0000"/>
          <bitfield name="PRI_N3" caption="Priority of interrupt number 4n+3" mask="0xFF000000"/>
        </register>
      </register-group>
    </module>
    <module name="SCB" version="1.0.0" caption="System Control Block">
      <register-group name="SCB" caption="System Control Block">
        <register name="CPUID" offset="0x0" rw="R" size="4" access-size="4" caption="CPUID base register">
          <bitfield name="Revision" caption="Revision number" mask="0xF"/>
          <bitfield name="PartNo" caption="Part number, 0xD20=Cortex-M23" mask="0xFFF0"/>
          <bitfield name="Architecture" caption="Architecture version, 0xC=ARMv8-M Base Line, 0xF=ARMv8-M Main Line" mask="0xF0000"/>
          <bitfield name="Variant" caption="Variant number" mask="0xF00000"/>
          <bitfield name="Implementer" caption="Implementer code, ARM=0x41" mask="0xFF000000"/>
        </register>
        <register name="ICSR" offset="0x4" rw="RW" size="4" access-size="4" caption="Interrupt Control and State Register">
          <bitfield name="VECTACTIVE" caption="Vector active" mask="0x1FF"/>
          <bitfield name="RETTOBASE" caption="Return to base" mask="0x800"/>
          <bitfield name="VECTPENDING" caption="Vector pending" mask="0x1FF000"/>
          <bitfield name="ISRPENDING" caption="Interrupt pending" mask="0x400000"/>
          <bitfield name="ISRPREEMPT" caption="Interrupt preempt" mask="0x800000"/>
          <bitfield name="PENDSTCLR" caption="Pend SysTick clear" mask="0x2000000" values="SCB_ICSR__PENDSTCLR"/>
          <bitfield name="PENDSTSET" caption="Pend SysTick set" mask="0x4000000" values="SCB_ICSR__PENDSTSET"/>
          <bitfield name="PENDSVCLR" caption="Pend PendSV clear" mask="0x8000000" values="SCB_ICSR__PENDSVCLR"/>
          <bitfield name="PENDSVSET" caption="Pend PendSV set" mask="0x10000000" values="SCB_ICSR__PENDSVSET"/>
          <bitfield name="PENDNMICLR" caption="Pend NMI clear" mask="0x40000000"/>
          <bitfield name="PENDNMISET" caption="Pend NMI set" mask="0x80000000" values="SCB_ICSR__PENDNMISET"/>
        </register>
        <register name="VTOR" offset="0x8" rw="RW" size="4" access-size="4" caption="Vector Table Offset Register">
          <bitfield name="TBLOFF" caption="Vector table base offset" mask="0xFFFFFF80"/>
        </register>
        <register name="AIRCR" offset="0xC" rw="RW" size="4" access-size="4" caption="Application Interrupt and Reset Control Register">
          <bitfield name="VECTCLRACTIVE" caption="Debug: Clear Active State" mask="0x2" values="SCB_AIRCR__VECTCLRACTIVE"/>
          <bitfield name="SYSRESETREQ" caption="System Reset Request" mask="0x4" values="SCB_AIRCR__SYSRESETREQ"/>
          <bitfield name="SYSRESETREQS" caption="System Reset Request Secure only" mask="0x8" values="SCB_AIRCR__SYSRESETREQS"/>
          <bitfield name="BFHFNMINS" caption="BusFault, HardFault and NMI Non-secure enable" mask="0x2000" values="SCB_AIRCR__BFHFNMINS"/>
          <bitfield name="PRIS" caption="Prioritize Secure Exceptions" mask="0x4000" values="SCB_AIRCR__PRIS"/>
          <bitfield name="ENDIANNESS" caption="Data Endianness, 0=little, 1=big" mask="0x8000" values="SCB_AIRCR__ENDIANNESS"/>
          <bitfield name="VECTKEY" caption="Register Key (0x05FA)" mask="0xFFFF0000"/>
        </register>
        <register name="SCR" offset="0x10" rw="RW" size="4" access-size="4" caption="System Control Register">
          <bitfield name="SLEEPONEXIT" caption="Sleep on exit" mask="0x2" values="SCB_SCR__SLEEPONEXIT"/>
          <bitfield name="SLEEPDEEP" caption="Sleep deep" mask="0x4" values="SCB_SCR__SLEEPDEEP"/>
          <bitfield name="SLEEPDEEPS" caption="Sleep deep secure" mask="0x8"/>
          <bitfield name="SEVONPEND" caption="Send Event on Pending bit" mask="0x10" values="SCB_SCR__SEVONPEND"/>
        </register>
        <register name="CCR" offset="0x14" rw="RW" size="4" access-size="4" caption="Configuration and Control Register">
          <bitfield name="USERSETMPEND" caption="User set main pending" mask="0x2"/>
          <bitfield name="UNALIGN_TRP" caption="Unaligned trap" mask="0x8" values="SCB_CCR__UNALIGN_TRP"/>
          <bitfield name="DIV_0_TRP" caption="Divide by zero trap" mask="0x10"/>
          <bitfield name="BFHFNMIGN" caption="BusFault in HardFault or NMI ignore" mask="0x100"/>
          <bitfield name="STKOFHFNMIGN" caption="Stack overflow in HardFault and NMI ignore" mask="0x400"/>
          <bitfield name="DC" caption="Data cache enable" mask="0x10000"/>
          <bitfield name="IC" caption="Instruction cache enable" mask="0x20000"/>
          <bitfield name="BP" caption="Branch prediction enable" mask="0x40000"/>
        </register>
        <register name="SHPR2" offset="0x1C" rw="RW" size="4" access-size="4" caption="System Handler Priority Register 2">
          <bitfield name="PRI_11" caption="Priority of system handler 11, SVCall" mask="0xFF000000"/>
        </register>
